# from datetime import datetime
# print(datetime.now())


# comment
# \n  --->  перенос на новую строку
# \t  --->  табуляция (tab__)
# \   --->  зеркалирование
# sep="-"
# end=","


# int --> целое число -12
# float --> дробь число -12.5
# bool --> логический тип данных 'True' & 'False'
# str --> ряд - массив (набор) символов
# := --> моржовый оператор

# Операторы
#  == - вернет True
# != - вернет True
# not - инверсия / если значение True --> станет False или наоборот
#


# [] - индексаторы
# индексы считаются с нуля -0-
